flume_tasks/cases/task3_current_nocylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          3000;
        startFace       1774000;
    }
    outlet
    {
        type            patch;
        nFaces          3000;
        startFace       1777000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8000;
        startFace       1780000;
    }
    atmosphere
    {
        type            patch;
        nFaces          8000;
        startFace       1788000;
    }
    frontAndBack
    {
        type            slip;
        inGroups        1(slip);
        nFaces          30000;
        startFace       1796000;
        faces           ( ( 0 1 5 4 ) ( 4 5 9 8 ) ( 8 9 13 12 ) ( 3 7 6 2 ) ( 7 11 10 6 ) ( 11 15 14 10 ) );
    }
)

// ************************************************************************* //
