flume_tasks/cases/task3_current_nocylinder/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0.8;

seaLevelAsReference true;

relaxationNames     ( );

initializationName  inlet;

inletCoeffs
{
    waveType            stokesFirst;
    Tsoft               2;
    depth               0.8;
    period              3;
    direction           ( 1 0 0 );
    phi                 0;
    height              0.05;
    waveNumber          (0.79522 0 0);
    omega               2.0944;

    GABCSettings
    {
        preProcessMethod    polynomialDefault;
        defaultRange        "kh000_030";
        shapeFunction       P03Celerity;
        a0                  1.6207;
        a1                  0;
        a2                  -2.7209;
        a3                  1.5429;
        depth               0.8;
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0.2 0 0 );
    Tsoft               2;

    GABCSettings
    {
        preProcessMethod    polynomialDefault;
        defaultRange        "kh000_030";
        shapeFunction       P03Celerity;
        a0                  1.6207;
        a1                  0;
        a2                  -2.7209;
        a3                  1.5429;
        depth               0.8;
    }
}



// ************************************************************************* //
