flume_tasks/cases/task3_current_nocylinder/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr          1;
        nAlphaSubCycles     1;
        alphaOuterCorrectors yes;
        cAlpha              1;
        MULESCorr           no;
        nLimiterIter        3;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
        maxIter         50;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         4;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors    1;
    nAlphaCorr          1;
    cAlpha              1;
    nAlphaSubCycles     1;
    correctPhi          on;
    checkMeshCourantNo  true;
}
